src/main/resources/xml/accommodationFulfillmentServicePort/swapGuests/swapGuests.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:swapGuests>
         <request>
            <!--Zero or more repetitions:-->
            <swapGuestsRequestDetails>
               <!--Optional:-->
               <guestId>?</guestId>
               <!--Optional:-->
               <oldTravelComponentGroupingId>?</oldTravelComponentGroupingId>
               <!--Optional:-->
               <newTravelComponentGroupingId>?</newTravelComponentGroupingId>
            </swapGuestsRequestDetails>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:swapGuests>
   </soapenv:Body>
</soapenv:Envelope>
